# --------------第一題--------------
print('--------------第一題--------------')
def func(arg, li=[]):
    li.append(arg)
    return li

v1 = func(1)
v2 = func(2, [])
v3 = func(3)

# v1和v3使用同一個列表
# v2使另一個新的列表
print(v1)  # => [1, 3]
print(v2)  # => [2]
print(v3)  # => [1, 3]

# --------------第二題--------------
print('--------------第二題--------------')
n1 = [11, 22, 33, 44, 55]
n2 = n1  # n2指向和n1同一個內存
n3 = n1[:]  # 切片是重新複製一份，在創建數據

n1[0] = 666
n3[1] = 999

print(n1)  # => [666, 22, 33, 44, 55]
print(n2)  # => [666, 22, 33, 44, 55]
print(n3)  # => [11, 999, 33, 44, 55]


